wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_adc.c
    if(ADC2 == adc_periph) {
        if(ADC_RESOLUTION_14B == resolution) {
            /* illegal parameters */
        } else {
            ADC_CTL0(adc_periph) |= (uint32_t)CTL0_DRES(resolution - 1U);
        }
    } else {
        if(ADC_RESOLUTION_6B == resolution) {
            /* illegal parameters */
        } else {
            ADC_CTL0(adc_periph) |= (uint32_t)CTL0_DRES(resolution);
        }
    }
}

/*!
    \brief      enable or disable ADC internal channels (API_ID(0x000AU))
    \param[in]  internal_channel: the internal channels
                one or more parameters can be selected which is shown as below:
      \arg        ADC_CHANNEL_INTERNAL_TEMPSENSOR: temperature sensor channel
      \arg        ADC_CHANNEL_INTERNAL_VREFINT: vrefint channel
      \arg        ADC_CHANNEL_INTERNAL_VBAT: vbat channel
      \arg        ADC_CHANNEL_INTERNAL_HP_TEMPSENSOR: high-precision temperature sensor channel
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_internal_channel_config(uint32_t internal_channel, ControlStatus newvalue)
{
    uint32_t adc0_chn, adc2_chn;

    adc0_chn = (internal_channel & ADC_CHANNEL_INTERNAL_MASK) & ADC_CTL1_INREFEN;
    adc2_chn = (internal_channel & ADC_CHANNEL_INTERNAL_MASK) & ~ADC_CTL1_INREFEN;

    if(0U != adc0_chn) {
        if(ENABLE == newvalue) {
            ADC_CTL1(ADC0) |= ADC_CTL1_INREFEN;
        } else {
            ADC_CTL1(ADC0) &= ~ADC_CTL1_INREFEN;
        }
    }

    if(0U != adc2_chn) {
        if(ENABLE == newvalue) {
            ADC_CTL1(ADC2) |= (uint32_t)adc2_chn;
        } else {
            ADC_CTL1(ADC2) &= ~((uint32_t)adc2_chn);
        }
    }
}

/*!
    \brief      enable inserted channel DMA request (API_ID(0x000BU))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[out] none
    \retval     none
*/
void adc_dma_mode_enable(uint32_t adc_periph, uint8_t adc_sequence)
{
    /* enable routine channel DMA request */
    if(RESET != (adc_sequence & ADC_ROUTINE_CHANNEL)) {
        ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_RDMA;
    }
    /* enable inserted channel DMA request */
    if(RESET != (adc_sequence & ADC_INSERTED_CHANNEL)) {
        ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_IDMA;
    }
}

/*!
    \brief      disable inserted channel DMA request (API_ID(0x000CU))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[out] none
    \retval     none
*/
void adc_dma_mode_disable(uint32_t adc_periph, uint8_t adc_sequence)
{
    /* disable routine channel DMA request */
    if(RESET != (adc_sequence & ADC_ROUTINE_CHANNEL)) {
        ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_RDMA);
    }
    /* disable inserted channel DMA request */
    if(RESET != (adc_sequence & ADC_INSERTED_CHANNEL)) {
        ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_IDMA);
    }
}

/*!
    \brief      when IDMA=1, the DMA engine issues a request at end of each sequence conversion (API_ID(0x000DU))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[out] none
    \retval     none
*/
void adc_dma_request_after_last_enable(uint32_t adc_periph, uint8_t adc_sequence)
{
    /* enable routine channel DMA engine issues a request at end of each sequence conversion */
    if(RESET != (adc_sequence & ADC_ROUTINE_CHANNEL)) {
        ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_RDDM;
    }
    /* enable inserted channel DMA engine issues a request at end of each sequence conversion */
    if(RESET != (adc_sequence & ADC_INSERTED_CHANNEL)) {
        ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_IDDM;
    }
}

/*!
    \brief      the DMA engine is disabled after the end of transfer signal from DMA controller is detected (API_ID(0x000EU))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[out] none
    \retval     none
*/
void adc_dma_request_after_last_disable(uint32_t adc_periph, uint8_t adc_sequence)
{
    /* disable routine channel DMA engine issues a request at end of each sequence conversion */
    if(RESET != (adc_sequence & ADC_ROUTINE_CHANNEL)) {
        ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_RDDM);
    }
    /* disable inserted channel DMA engine issues a request at end of each sequence conversion */
    if(RESET != (adc_sequence & ADC_INSERTED_CHANNEL)) {
        ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_IDDM);
    }
}

/*!
    \brief      enable hpdf mode (API_ID(0x000FU))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_hpdf_mode_enable(uint32_t adc_periph)
{
    /* enable hpdf mode */
    ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_HPDFCFG;
}

/*!
    \brief      disable hpdf mode (API_ID(0x0010U))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_hpdf_mode_disable(uint32_t adc_periph)
{
    /* disable hpdf mode */
    ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_HPDFCFG);
}

/*!
    \brief      configure ADC discontinuous mode (API_ID(0x0011U))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
      \arg        ADC_CHANNEL_DISCON_DISABLE: disable discontinuous mode of routine & inserted channel
    \param[in]  length: number of conversions in discontinuous mode, the number can be 1..8
                        for routine channel, the number has no effect for inserted channel
    \param[out] none
    \retval     none
*/
void adc_discontinuous_mode_config(uint32_t adc_periph, uint8_t adc_sequence, uint32_t length)
{
    /* disable discontinuous mode of routine & inserted channel */
    ADC_CTL0(adc_periph) &= ~((uint32_t)(ADC_CTL0_DISRC | ADC_CTL0_DISIC));
    switch(adc_sequence) {
    case ADC_ROUTINE_CHANNEL:
        /* config the number of conversions in discontinuous mode  */
        ADC_CTL0(adc_periph) &= ~((uint32_t)ADC_CTL0_DISNUM);
        if((length <= 8U) && (length >= 1U)) {
            ADC_CTL0(adc_periph) |= CTL0_DISNUM((uint32_t)(length - ADC_CHANNEL_LENGTH_SUBTRACT_ONE));
        }
        /* enable routine sequence discontinuous mode */
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_DISRC;
        break;
    case ADC_INSERTED_CHANNEL:
        /* enable inserted sequence discontinuous mode */
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_DISIC;
        break;
    case ADC_CHANNEL_DISCON_DISABLE:
    /* disable discontinuous mode of routine & inserted channel */
    default:
        break;
    }
}

/*!
    \brief      configure the length of routine sequence or inserted sequence (API_ID(0x0012U))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[in]  length: the length of the channel
                        routine channel 1-16
                        inserted channel 1-4
    \param[out] none
    \retval     none
*/
void adc_channel_length_config(uint32_t adc_periph, uint8_t adc_sequence, uint32_t length)
{
    switch(adc_sequence) {
    case ADC_ROUTINE_CHANNEL:
        if((length >= 1U) && (length <= 16U)) {
            ADC_RSQ0(adc_periph) &= ~((uint32_t)ADC_RSQ0_RL);
            ADC_RSQ0(adc_periph) |= RSQ0_RL((uint32_t)(length - ADC_CHANNEL_LENGTH_SUBTRACT_ONE));
        }
        break;
    case ADC_INSERTED_CHANNEL:
        if((length >= 1U) && (length <= 4U)) {
            ADC_ISQ0(adc_periph) &= ~((uint32_t)ADC_ISQ0_IL);
            ADC_ISQ0(adc_periph) |= ISQ0_IL((uint32_t)(length - ADC_CHANNEL_LENGTH_SUBTRACT_ONE));
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure ADC routine channel (API_ID(0x0013U))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  rank: the routine sequence rank,this parameter must be between 0 to 15
    \param[in]  adc_channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x(x=0..21): ADC Channelx
    \param[in]  sample_time: the sample time value, 0..809 for 14bit-ADC, 0..638 for 12bit-ADC
    \param[out] none
    \retval     none
*/
void adc_routine_channel_config(uint32_t adc_periph, uint8_t rank, uint8_t adc_channel,
                                uint32_t sample_time)
{
    uint32_t rsq;

    /* configure ADC routine sequence */
    if(rank < ADC_ROUTINE_CHANNEL_RANK_ONE) {
        /* the routine sequence rank is smaller than one */
        rsq = ADC_RSQ8(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH * rank)));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                rank));
        ADC_RSQ8(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_THREE) {
        /* the routine sequence rank is smaller than three */
        rsq = ADC_RSQ7(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_ONE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_ONE)));
        ADC_RSQ7(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_FIVE) {
        /* the routine sequence rank is smaller than five */
        rsq = ADC_RSQ6(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_THREE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_THREE)));
        ADC_RSQ6(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_SEVEN) {
        /* the routine sequence rank is smaller than seven */
        rsq = ADC_RSQ5(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_FIVE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_FIVE)));
        ADC_RSQ5(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_NINE) {
        /* the routine sequence rank is smaller than nine */
        rsq = ADC_RSQ4(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_SEVEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_SEVEN)));
        ADC_RSQ4(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_ELEVEN) {
        /* the routine sequence rank is smaller than eleven */
        rsq = ADC_RSQ3(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_NINE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_NINE)));
        ADC_RSQ3(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_THIRTEEN) {
        /* the routine sequence rank is smaller than thirteen */
        rsq = ADC_RSQ2(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_ELEVEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_ELEVEN)));
        ADC_RSQ2(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_FIFTEEN) {
        /* the routine sequence rank is smaller than fifteen */
        rsq = ADC_RSQ1(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_THIRTEEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_THIRTEEN)));
        ADC_RSQ1(adc_periph) = rsq;
    } else if(rank < ADC_ROUTINE_CHANNEL_RANK_SIXTEEN) {
        /* the routine sequence rank is smaller than sixteen */
        rsq = ADC_RSQ0(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                            (rank - ADC_ROUTINE_CHANNEL_RANK_FIFTEEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | (adc_channel & ADC_RSQX_RSQN)) << (ADC_ROUTINE_CHANNEL_SHIFT_LENGTH *
                (rank - ADC_ROUTINE_CHANNEL_RANK_FIFTEEN)));
        ADC_RSQ0(adc_periph) = rsq;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure ADC inserted channel (API_ID(0x0014U))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  rank: the inserted sequence rank,this parameter must be between 0 to 3
    \param[in]  adc_channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x(x=0..21): ADC Channelx
    \param[in]  sample_time: The sample time value, 0..809 for 14bit-ADC, 0..638 for 12bit-ADC
    \param[out] none
    \retval     none
*/
void adc_inserted_channel_config(uint32_t adc_periph, uint8_t rank, uint8_t adc_channel,
                                 uint32_t sample_time)
{
    uint8_t inserted_length, rankx;
    uint32_t isq;

    /* get inserted sequence length */
    inserted_length = (uint8_t)GET_BITS(ADC_ISQ0(adc_periph), 20U, 21U);
    rankx = ADC_OFFSET_LENGTH - inserted_length + rank;

